import { z } from 'zod'

export const testimonialScheme = z.object({
  name: z
    .string()
    .length(1, 'Поле має бути заповнене')
    .max(25, 'Ім’я має містити максимум 25 символів'),

  email: z
    .string()
    .length(1, 'Поле має бути заповнене')
    .min(2, 'Електронна пошта має містити мінімум 2 символи')
    .max(55, 'Електронна пошта має містити максимум 55 символів')
    .refine(
      (value) =>
        /^[a-zA-Z0-9_%+-]*(?:\.[a-zA-Z0-9_%+-]+)?[a-zA-Z0-9_%+-]+@[a-zA-Z0-9_%+-]*(?:\.[a-zA-Z0-9_%+-]+)?[a-zA-Z0-9_%+-]+\.[a-zA-Z]{2,}$/.test(
          value
        ),
      {
        message: 'Некоректно введений email'
      }
    ),

  message: z
    .string()
    .length(1, 'Поле має бути заповнене')
    .min(2, 'Коментар має містити мінімум 2 символи')
    .max(300, 'Коментар має містити максимум 300 символів')
})
