import { z } from 'zod'


export const addCourseValidation = z.object({
  title: z
    .string()
    .nonempty('Поле повинно бути заповнене')
    .min(2, 'Питання має містити мінімум 2 символи')
    .max(125, 'Питання має містити максимум 125 символи'),
    color: z
    .string()
    .nonempty('Виберіть колір'),
    description: z.string()
    .nonempty('Поле повинно бути заповнене')
    .min(2, 'Питання має містити мінімум 2 символи')
    .max(300, 'Питання має містити максимум 300 символи'),
    descriptionEn: z.string()
    .nonempty('Поле повинно бути заповнене')
    .min(2, 'Питання має містити мінімум 2 символи')
    .max(300, 'Питання має містити максимум 300 символи'),
    tagsUa1: z.string()
    .nonempty('Поле повинно бути заповнене')
    .min(2, 'Питання має містити мінімум 2 символи')
    .max(24, 'Питання має містити максимум 24 символи'),
      tagsUa2:z.string()
      .nonempty('Поле повинно бути заповнене')
      .min(2, 'Питання має містити мінімум 2 символи')
      .max(24, 'Питання має містити максимум 24 символи'),
      tagsUa3: z.string()
      .nonempty('Поле повинно бути заповнене')
      .min(2, 'Питання має містити мінімум 2 символи')
      .max(24, 'Питання має містити максимум 24 символи'),
      tagsUa4: z.string(),
      tagsEn1: z.string()
      .nonempty('Поле повинно бути заповнене')
      .min(2, 'Питання має містити мінімум 2 символи')
      .max(24, 'Питання має містити максимум 24 символи'),
        tagsEn2:z.string()
        .nonempty('Поле повинно бути заповнене')
        .min(2, 'Питання має містити мінімум 2 символи')
        .max(24, 'Питання має містити максимум 24 символи'),
        tagsEn3: z.string()
        .nonempty('Поле повинно бути заповнене')
        .min(2, 'Питання має містити мінімум 2 символи')
        .max(24, 'Питання має містити максимум 24 символи'),
        tagsEn4: z.string(),
     
      
})
