import { z } from 'zod'


export const addCourseValidation = z.object({
  title: z
    .string()
    .nonempty('Поле повинно бути заповнене')
    .min(2, 'Текст має містити мінімум 2 символи')
    .max(125, 'Текст має містити максимум 125 символи'),
    color: z
    .string()
    .nonempty('Виберіть колір'),
    descriptionUa: z.string()
    .nonempty('Поле повинно бути заповнене')
    .min(2, 'Текст має містити мінімум 2 символи')
    .max(300, 'Текст має містити максимум 300 символи'),
    descriptionEn: z.string()
    .nonempty('Поле повинно бути заповнене')
    .min(2, 'Текст має містити мінімум 2 символи')
    .max(300, 'Текст має містити максимум 300 символи'),
    tagsUa1: z.string()
    .nonempty('Заповніть поле')
    .min(2, 'Текст має містити мінімум 2 символи')
    .max(24, 'Текст має містити максимум 24 символи'),
      tagsUa2:z.string()
      .nonempty('Заповніть поле')
      .min(2, 'Текст має містити мінімум 2 символи')
      .max(24, 'Текст має містити максимум 24 символи'),
      tagsUa3: z.string()
      .nonempty('Заповніть поле')
      .min(2, 'Текст має містити мінімум 2 символи')
      .max(24, 'Текст має містити максимум 24 символи'),
      tagsUa4: z.string(),
      tagsEn1: z.string()
      .nonempty('Заповніть поле')
      .min(2, 'Текст має містити мінімум 2 символи')
      .max(24, 'Текст має містити максимум 24 символи'),
        tagsEn2:z.string()
        .nonempty('Заповніть поле')
        .min(2, 'Текст має містити мінімум 2 символи')
        .max(24, 'Текст має містити максимум 24 символи'),
        tagsEn3: z.string()
        .nonempty('Заповніть поле')
        .min(2, 'Текст має містити мінімум 2 символи')
        .max(24, 'Текст має містити максимум 24 символи'),
        tagsEn4: z.string(),
        courseDescriptionUa1: z.string({required_error: 'Заповніть поле'})
        .nonempty('Заповніть поле')
        .min(2, 'Текст має містити мінімум 2 символи')
        .max(300, 'Текст має містити максимум 300 символи'),
        startDateUa: z.string({required_error: 'Заповніть поле'})
        .nonempty('Заповніть поле')
        .min(2, 'Текст має містити мінімум 2 символи')
        .max(24, 'Текст має містити максимум 24 символи'),
        numberOfPlacesUa:z.string({required_error: 'Заповніть поле'})
        .nonempty('Заповніть поле')
        .min(7, 'Текст має містити мінімум 7 символи')
        .max(9, 'Текст має містити максимум 9 символи'),
        priceUa: z.string({required_error: 'Заповніть поле'})
        .nonempty('Заповніть поле')
        .min(2, 'Текст має містити мінімум 2 символи')
        .max(24, 'Текст має містити максимум 24 символи'),
        courseDescriptionEn1: z.string({required_error: 'Заповніть поле'})
        .nonempty('Заповніть поле')
        .min(2, 'Текст має містити мінімум 2 символи')
        .max(300, 'Текст має містити максимум 300 символи'),
        startDateEn: z.string({required_error: 'Заповніть поле'})
        .nonempty('Заповніть поле')
        .min(2, 'Текст має містити мінімум 2 символи')
        .max(24, 'Текст має містити максимум 24 символи'),
        numberOfPlacesEn:z.string({required_error: 'Заповніть поле'})
        .nonempty('Заповніть поле')
        .min(7, 'Текст має містити мінімум 7 символи')
        .max(9, 'Текст має містити максимум 9 символи'),
        priceEn: z.string({required_error: 'Заповніть поле'})
        .nonempty('Заповніть поле')
        .min(2, 'Текст має містити мінімум 2 символи')
        .max(24, 'Текст має містити максимум 24 символи'),
      
})
