export type questionParents = {
  question: string
  answer: Array<string>
  color: string
}

export type iconParents = {
  src: string
  width: number
  height: number
  className: string
}

export const questionList: Array<questionParents> = [
  {
    color: '#aaaedf',
    question: 'Платформа',
    answer:
      ["Освітньо-соціальна платформа MindLab Hub для тинейджерів і підлітків - це інноваційний і безпечний осередок, створений для розвитку, навчання та взаємодії. Ми прагнемо надати молоді та обдарованій генерації можливість здобувати знання, збирати натхнення, знаходити власний шлях у житті та планувати свою кар'єру. Ці складові дозволять підтримати вмотивовану молодь-майбутніх лідерів, що станут до розбудови України.", "Ми знайомимо молодь з наступними напрямками:Лідерство, бізнес, політологія та соціологія,  сучасні технології, мистецтво, кар’єрне консультування, кар’єрний супровід, що допомагають учням розширювати свої знання та навички."]
  },
  {
    color: '#ffecd0',
    question: 'Спікери та ментори',
    answer:
      ["Платформа представляє можливість слухати лекції та отримувати поради від відомих фахівців у різних сферах. Інтерактивні вебінари та інтерв'ю із успішними особистостями надихають та допомагають учням зрозуміти свої можливості.", " Ми знайомимо молодь з наступними напрямками:Лідерство, бізнес, політологія та соціологія,  сучасні технології, мистецтво, кар’єрне консультування, кар’єрний супровід, що допомагають учням розширювати свої знання та навички."]
  },
  {
    color: '#8d83ff',
    question: 'Профорієнтація',
    answer:
      ["Запропоновані інструменти профорієнтації допомагають визначити власні сильні та слабкі сторони, розкривають можливі кар'єрні шляхи та допомагають у виборі майбутньої професії."]
  },
  {
    color: '#03aa89',
    question: "Кар'єрне Консультування",
    answer:
      ["На платформі існує можливість отримати консультації від професійних кар'єрних консультантів, які допоможуть визначити стратегію розвитку кар'єри та скласти план досягнення поставлених цілей. Консультанти представляють плеяду успішних бізнесменів, політиків, відомих у різних сферах діяльності особистостей."]
  },
  {
    color: '#fed1ce',
    question: 'Спілкування',
    answer:
      ["Платформа може стати майданчиком для спілкування між підлітками, студентами, викладачами, менторами, MindLab  створює простір для віртуального спілкування, обміну ідеями та досвідом між учасниками. Це сприяє формуванню дружби, обміну знаннями та взаємопідтримці.", "Ми допомагаємо учням будувати мережу зв'язків, зокрема з представниками університетів. За допомогою нашої платформи, користувачі зможуть зробити освітній вибір, обговорити деталі навчання та отримати поради від студентів і випускників. Наша платформа прагне стати віртуальним партнером у розвитку та самовдосконаленні для кожного підлітка, надаючи інструменти та ресурси для їхнього успіху в майбутньому."]
  }
]

export const iconParents: Array<iconParents> = [
  {
    src: '/parents/lineIcon-1.svg',
    width: 70,
    height: 107,
    className: 'lineIcon1'
  }, 
  {
    src: '/parents/lineIcon-2.svg',
    width:109,
    height: 70,
    className: 'lineIcon2'
  },
  {
    src: '/parents/starIcon.svg',
    width: 26,
    height: 26,
    className: 'star1'
  },
  {
    src: '/parents/starIcon.svg',
    width: 19,
    height: 19,
    className: 'star2'
  },
  {
    src: '/parents/starIcon.svg',
    width: 19,
    height: 19,
    className: 'star3'
  }
]
