export const reviews = [
  {
    image: '/reviews/review_1.png',
    name: 'Ілона Петренко',
    text: 'При скролі ліва частина екрану залишається на місці,а ліва скролиться горизонтально Таким чином користувач обов’язково побачить всіх партнерів'
  },
  {
    image: '/reviews/review_2.png',
    name: 'Ілона Петренко',
    text: 'При скролі ліва частина екрану залишається на місці,а ліва скролиться горизонтально Таким чином користувач обов’язково побачить всіх партнерів'
  },
  {
    image: '/reviews/review_1.png',
    name: 'Ілона Петренко',
    text: 'При скролі ліва частина екрану залишається на місці,а ліва скролиться горизонтально Таким чином користувач обов’язково побачить всіх партнерів'
  },
  {
    image: '/reviews/review_2.png',
    name: 'Ілона Петренко',
    text: 'При скролі ліва частина екрану залишається на місці,а ліва скролиться горизонтально Таким чином користувач обов’язково побачить всіх партнерів'
  },
  {
    image: '/reviews/review_1.png',
    name: 'Ілона Петренко',
    text: 'При скролі ліва частина екрану залишається на місці,а ліва скролиться горизонтально Таким чином користувач обов’язково побачить всіх партнерів'
  },
  {
    image: '/reviews/review_2.png',
    name: 'Ілона Петренко',
    text: 'При скролі ліва частина екрану залишається на місці,а ліва скролиться горизонтально Таким чином користувач обов’язково побачить всіх партнерів'
  },
  {
    image: '/reviews/review_1.png',
    name: 'Ілона Петренко',
    text: 'При скролі ліва частина екрану залишається на місці,а ліва скролиться горизонтально Таким чином користувач обов’язково побачить всіх партнерів'
  },
  {
    image: '/reviews/review_2.png',
    name: 'Ілона Петренко',
    text: 'При скролі ліва частина екрану залишається на місці,а ліва скролиться горизонтально Таким чином користувач обов’язково побачить всіх партнерів'
  }
];
