export const aboutData = [
  'Люблю дизайн та програмування. Не дуже вмію менеджерити, але добре вмію робити речі руками. Допомагаю людям як ментор у вільний час.',
  'Навчу писати тексти для різних каналів та авдиторій. Зорієнтую на чому зробити фокус у розвитку карʼєри.'
]

export const coursesData = [
  {
    title: 'Leadership',
    description:
      'Це курс, який розкриє в тобі здатність впливати на інших, надихати і керувати командою',
    tags: ['Формування системи лідерства', 'Корпоративна влада', 'Влада лідера']
  }
]
